Repository: ty-kim/NeuroRune
Catalog: NeuroRune/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans, zh_hant

# a11y.chat.autoSendCountdown
source: 자동 전송 카운트다운. 탭하여 즉시 전송.
en: Auto-send countdown. Tap to send now.
ja: 自動送信カウントダウン。タップで今すぐ送信。
zh_hans: 自动发送倒计时。点击立即发送。
zh_hant: 自動傳送倒數。點擊立即傳送。

# a11y.chat.effort
source: 응답 강도
en: Effort
ja: 応答強度
zh_hans: 应答强度
zh_hant: 應答強度

# a11y.chat.menuButton
source: 메뉴
en: Menu
ja: メニュー
zh_hans: 菜单
zh_hant: 選單

# a11y.chat.sendButton
source: 메시지 전송
en: Send message
ja: メッセージを送信
zh_hans: 发送消息
zh_hant: 傳送訊息

# a11y.chat.startRecording
source: 음성 녹음 시작
en: Start voice recording
ja: 音声録音を開始
zh_hans: 开始录音
zh_hant: 開始錄音

# a11y.chat.stopButton
source: 스트리밍 중단
en: Stop streaming
ja: ストリーミングを停止
zh_hans: 停止流式传输
zh_hant: 停止串流

# a11y.chat.stopRecording
source: 음성 녹음 종료
en: Stop voice recording
ja: 音声録音を停止
zh_hans: 停止录音
zh_hant: 停止錄音

# a11y.chat.ttsSettings
source: 음성 설정
en: Voice settings
ja: Voice settings
zh_hans: Voice settings
zh_hant: Voice settings

# a11y.list.memory
source: 메모리 파일
en: Memory files
ja: メモリファイル
zh_hans: 记忆文件
zh_hant: 記憶檔案

# a11y.list.newChat
source: 새 대화
en: New chat
ja: 新しいチャット
zh_hans: 新聊天
zh_hant: 新聊天

# a11y.message.assistant
source: 어시스턴트
en: Assistant
ja: アシスタント
zh_hans: 助手
zh_hant: 助手

# a11y.message.playAudio
source: 음성 재생
en: Play audio
ja: Play audio
zh_hans: Play audio
zh_hant: Play audio

# a11y.message.stopAudio
source: 재생 중지
en: Stop audio
ja: Stop audio
zh_hans: Stop audio
zh_hant: Stop audio

# a11y.message.user
source: 나
en: You
ja: あなた
zh_hans: 你
zh_hant: 你

# a11y.modelPicker.effortSupported
source: 응답 강도 조절 지원
en: Supports effort control
ja: 応答強度の調整をサポート
zh_hans: 支持强度调整
zh_hant: 支援強度調整

# a11y.onboarding.apiKeyField
source: API 키 입력
en: API key input
ja: APIキー入力
zh_hans: API 密钥输入
zh_hant: API 密鑰輸入

# a11y.onboarding.apiKeyHint
source: sk-ant-로 시작하는 Anthropic API 키를 입력하세요
en: Enter your Anthropic API key starting with sk-ant-
ja: sk-ant-で始まるAnthropic APIキーを入力してください
zh_hans: 请输入以 sk-ant- 开头的 Anthropic API 密钥
zh_hant: 請輸入以 sk-ant- 開頭的 Anthropic API 密鑰

# a11y.onboarding.hideKey
source: API 키 숨기기
en: Hide API key
ja: APIキーを隠す
zh_hans: 隐藏 API 密钥
zh_hant: 隱藏 API 密鑰

# a11y.onboarding.revealKey
source: API 키 표시
en: Show API key
ja: APIキーを表示
zh_hans: 显示 API 密钥
zh_hant: 顯示 API 密鑰

# chat.inputPlaceholder
source: 메시지를 입력하세요
en: Type a message
ja: メッセージを入力
zh_hans: 输入消息
zh_hant: 輸入訊息

# chat.menu.title
source: 설정
en: Settings
ja: 設定
zh_hans: 设置
zh_hant: 設定

# chat.resetApiKey
source: API 키 초기화
en: Reset API Key
ja: APIキーをリセット
zh_hans: 重置 API 密钥
zh_hant: 重置 API 密鑰

# common.done
source: 완료
en: Done
ja: 完了
zh_hans: 完成
zh_hant: 完成

# common.ok
source: 확인
en: OK
ja: OK
zh_hans: 确定
zh_hant: 確定

# consolidation.accept
source: 수락
en: Accept
ja: 受け入れ
zh_hans: 接受
zh_hant: 接受

# consolidation.action.create
source: 생성
en: CREATE
ja: 作成
zh_hans: 新建
zh_hant: 新建

# consolidation.action.delete
source: 삭제
en: DELETE
ja: 削除
zh_hans: 删除
zh_hant: 刪除

# consolidation.action.skip
source: 건너뜀
en: SKIP
ja: スキップ
zh_hans: 跳过
zh_hant: 跳過

# consolidation.action.update
source: 갱신
en: UPDATE
ja: 更新
zh_hans: 更新
zh_hant: 更新

# consolidation.diff
source: 변경 내용
en: Diff
ja: 差分
zh_hans: 差异
zh_hant: 差異

# consolidation.empty.quietMorning
source: 오늘은 정제할 새 패턴 없음. 조용한 morning이 좋은 morning.
en: No new patterns today. Quiet mornings are good mornings.
ja: 今日は新しいパターンなし。 静かな朝こそ良い朝。
zh_hans: 今天没有新模式。 安静的早晨是好早晨。
zh_hant: 今天沒有新模式。 安靜的早晨是好早晨。

# consolidation.empty.tapToStart
source: 반짝이 아이콘을 눌러 시작.
en: Tap sparkles to start.
ja: きらめきをタップして開始。
zh_hans: 点击闪烁图标开始。
zh_hant: 點擊閃爍圖示開始。

# consolidation.error.empty
source: 응답이 비어있습니다.
en: Empty response.
ja: 空の応答です。
zh_hans: 响应为空。
zh_hant: 回應為空。

# consolidation.error.invalidJSON
source: 응답 형식이 올바르지 않습니다.
en: Response format invalid.
ja: 応答形式が無効です。
zh_hans: 响应格式无效。
zh_hant: 回應格式無效。

# consolidation.error.llm
source: LLM 호출 실패.
en: LLM call failed.
ja: LLM呼び出しに失敗しました。
zh_hans: LLM 调用失败。
zh_hant: LLM 呼叫失敗。

# consolidation.loading
source: 대화·메모리 살피는 중…
en: Reviewing conversations and memory…
ja: 会話とメモリを確認中…
zh_hans: 正在整理对话与记忆…
zh_hant: 正在整理對話與記憶…

# consolidation.preview
source: 미리보기
en: Preview
ja: プレビュー
zh_hans: 预览
zh_hant: 預覽

# consolidation.reject
source: 거절
en: Reject
ja: 却下
zh_hans: 拒绝
zh_hant: 拒絕

# consolidation.runNow
source: 지금 정제
en: Consolidate now
ja: 今すぐ統合
zh_hans: 立即整理
zh_hant: 立即整理

# consolidation.title
source: 정제
en: Consolidation
ja: 統合
zh_hans: 整理
zh_hant: 整理

# credentials.clear
source: 저장된 설정 삭제
en: Clear Saved Settings
ja: Clear Saved Settings
zh_hans: Clear Saved Settings
zh_hant: Clear Saved Settings

# credentials.owner.placeholder
source: 소유자
en: Owner
ja: オーナー
zh_hans: 所有者
zh_hant: 擁有者

# credentials.pat
source: 개인 액세스 토큰
en: Personal Access Token
ja: パーソナルアクセストークン
zh_hans: 个人访问令牌
zh_hant: 個人存取權杖

# credentials.pat.footer
source: 'repo' 권한이 필요합니다. github.com/settings/tokens에서 발급하세요.
en: Needs 'repo' scope. Create one at github.com/settings/tokens.
ja: 'repo' スコープが必要です。github.com/settings/tokens で作成してください。
zh_hans: 需要 'repo' 权限。请在 github.com/settings/tokens 创建。
zh_hant: 需要 'repo' 權限。請在 github.com/settings/tokens 建立。

# credentials.path
source: 메모리 경로
en: Memory Path
ja: メモリパス
zh_hans: 记忆路径
zh_hant: 記憶路徑

# credentials.path.footer
source: repo 내 하위 디렉터리. 비워두면 repo 루트 사용.
en: Subdirectory within the repo. Leave empty to use the repo root.
ja: リポジトリ内のサブディレクトリ。空欄でルートを使用。
zh_hans: 仓库中的子目录。留空使用根目录。
zh_hant: 儲存庫中的子目錄。留空使用根目錄。

# credentials.path.placeholder
source: 예: memory (비워두면 루트)
en: e.g. memory (leave empty for root)
ja: 例: memory (空欄でルート)
zh_hans: 例如: memory（留空为根目录）
zh_hant: 例如: memory（留空為根目錄）

# credentials.repo
source: 저장소
en: Repository
ja: リポジトリ
zh_hans: 仓库
zh_hant: 儲存庫

# credentials.repo.placeholder
source: 저장소 이름
en: Repository name
ja: リポジトリ名
zh_hans: 仓库名称
zh_hant: 儲存庫名稱

# credentials.title
source: GitHub 설정
en: GitHub Settings
ja: GitHub 設定
zh_hans: GitHub 设置
zh_hant: GitHub 設定

# elevenlabs.apiKey
source: API 키
en: API Key
ja: API キー
zh_hans: API 密钥
zh_hant: API 金鑰

# elevenlabs.clear
source: 키 삭제
en: Clear key
ja: キーを削除
zh_hans: 清除密钥
zh_hant: 清除金鑰

# elevenlabs.footer
source: elevenlabs.io에서 API 키 발급. Keychain에 저장.
en: Get your API key at elevenlabs.io. Stored in Keychain.
ja: elevenlabs.io で API キーを取得。キーチェーンに保存。
zh_hans: 在 elevenlabs.io 获取 API 密钥。存储于 Keychain。
zh_hant: 在 elevenlabs.io 取得 API 金鑰。儲存於 Keychain。

# error.cancel
source: 취소
en: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# error.cancelled
source: 취소됨
en: Cancelled
ja: キャンセル済み
zh_hans: 已取消
zh_hant: 已取消

# error.decoding
source: 응답 파싱 오류
en: Response parsing error
ja: 応答解析エラー
zh_hans: 响应解析错误
zh_hant: 回應解析錯誤

# error.dismiss
source: 닫기
en: Dismiss
ja: 閉じる
zh_hans: 关闭
zh_hant: 關閉

# error.network
source: 네트워크 오류
en: Network error
ja: ネットワークエラー
zh_hans: 网络错误
zh_hant: 網路錯誤

# error.persistence.title
source: 대화 저장 실패
en: Couldn't save conversation
ja: 会話を保存できませんでした
zh_hans: 无法保存对话
zh_hant: 無法儲存對話

# error.prefix
source: 오류:
en: Error:
ja: エラー:
zh_hans: 错误:
zh_hant: 錯誤:

# error.rateLimited
source: 요청이 너무 많습니다. 잠시 후 다시 시도해주세요.
en: Too many requests. Please try again later.
ja: リクエストが多すぎます。しばらくしてからお試しください。
zh_hans: 请求过多，请稍后再试。
zh_hant: 請求過多，請稍後再試。

# error.retry
source: 재시도
en: Retry
ja: 再試行
zh_hans: 重试
zh_hant: 重試

# error.retry.countdown.format
source: %@ 후 재시도 가능
en: Retry available in %@
ja: %@ 後に再試行可能
zh_hans: %@ 后可重试
zh_hant: %@ 後可重試

# error.unauthorized
source: API 키가 유효하지 않습니다. 다시 입력해주세요.
en: Invalid API key. Please re-enter.
ja: APIキーが無効です。再入力してください。
zh_hans: API 密钥无效，请重新输入。
zh_hant: API 密鑰無效，請重新輸入。

# groq.clear
source: 저장된 키 삭제
en: Clear Saved Key
ja: Clear Saved Key
zh_hans: Clear Saved Key
zh_hant: Clear Saved Key

# groq.footer
source: console.groq.com에서 발급. Whisper(음성 인식)·LLM 등 공용. 무료 쿼터 제공.
en: Issue from console.groq.com. Shared across Whisper (STT) and LLM. Free tier available.
ja: Issue from console.groq.com. Shared across Whisper (STT) and LLM. Free tier available.
zh_hans: Issue from console.groq.com. Shared across Whisper (STT) and LLM. Free tier available.
zh_hant: Issue from console.groq.com. Shared across Whisper (STT) and LLM. Free tier available.

# groq.title
source: Groq API 키
en: Groq API Key
ja: Groq API Key
zh_hans: Groq API Key
zh_hant: Groq API Key

# list.delete
source: 삭제
en: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

# list.deleteFailed
source: 대화 삭제에 실패했습니다. 다시 시도해 주세요.
en: Couldn't delete the conversation. Please try again.
ja: 会話を削除できませんでした。もう一度お試しください。
zh_hans: 无法删除对话。请重试。
zh_hant: 無法刪除對話。請再試一次。

# list.empty
source: 대화가 없습니다
en: No conversations yet
ja: まだ会話がありません
zh_hans: 暂无对话
zh_hant: 暫無對話

# list.loadFailed
source: 대화 목록을 불러올 수 없습니다.
en: Couldn't load conversations.
ja: 会話を読み込めませんでした。
zh_hans: 无法加载对话。
zh_hant: 無法載入對話。

# list.newChat
source: 새 대화 시작
en: New Chat
ja: 新しいチャット
zh_hans: 开始新聊天
zh_hant: 開始新聊天

# list.title
source: 채팅 목록
en: Chats
ja: チャット
zh_hans: 聊天列表
zh_hant: 聊天列表

# list.untitled
source: 제목 없음
en: Untitled
ja: 無題
zh_hans: 无标题
zh_hant: 無標題

# memory.create.content
source: 내용
en: Content
ja: 内容
zh_hans: 内容
zh_hant: 內容

# memory.create.filename
source: 파일명
en: Filename
ja: ファイル名
zh_hans: 文件名
zh_hant: 檔名

# memory.create.filename.footer
source: .md 확장자는 생략 시 자동 추가됩니다.
en: .md extension is added automatically if omitted.
ja: .md 拡張子は省略時に自動付与されます。
zh_hans: 省略时自动添加 .md 扩展名。
zh_hant: 省略時自動加上 .md 副檔名。

# memory.create.filename.placeholder
source: 예: note_2026_04_13
en: e.g. note_2026_04_13
ja: 例: note_2026_04_13
zh_hans: 例如: note_2026_04_13
zh_hant: 例如: note_2026_04_13

# memory.create.save
source: 만들기
en: Create
ja: 作成
zh_hans: 创建
zh_hant: 建立

# memory.create.title
source: 새 메모리
en: New Memory
ja: 新しいメモリ
zh_hans: 新建记忆
zh_hant: 新增記憶

# memory.edit.discardConfirm
source: 버리기
en: Discard
ja: 破棄
zh_hans: 放弃
zh_hant: 放棄

# memory.edit.discardMessage
source: 편집 내용이 사라집니다.
en: Your edits will be lost.
ja: 編集内容が失われます。
zh_hans: 您的编辑将会丢失。
zh_hant: 您的編輯將會遺失。

# memory.edit.discardTitle
source: 저장되지 않은 변경 사항을 버리시겠습니까?
en: Discard unsaved changes?
ja: 未保存の変更を破棄しますか?
zh_hans: 放弃未保存的更改?
zh_hant: 放棄未儲存的變更?

# memory.edit.doneEditing
source: 완료
en: Done
ja: 完了
zh_hans: 完成
zh_hant: 完成

# memory.empty.noCredentials
source: 메모리 파일을 동기화하려면 GitHub 저장소를 연결하세요.
en: Connect a GitHub repository to sync memory files.
ja: メモリファイルを同期するには GitHub リポジトリを接続してください。
zh_hans: 连接 GitHub 仓库以同步记忆文件。
zh_hant: 連接 GitHub 儲存庫以同步記憶檔案。

# memory.empty.noFiles
source: 메모리 파일이 없습니다
en: No memory files yet
ja: メモリファイルはまだありません
zh_hans: 暂无记忆文件
zh_hant: 尚無記憶檔案

# memory.error.conflict
source: GitHub에서 파일이 변경되었습니다. 새로고침 후 다시 시도하세요.
en: File changed on GitHub. Refresh and try again.
ja: GitHub 上でファイルが変更されました。リフレッシュしてもう一度お試しください。
zh_hans: GitHub 上的文件已变更。请刷新后重试。
zh_hant: GitHub 上的檔案已變更。請重新整理後再試。

# memory.error.invalidBase64
source: 파일 내용 디코딩 실패.
en: Couldn't decode file content.
ja: ファイル内容をデコードできませんでした。
zh_hans: 无法解码文件内容。
zh_hant: 無法解碼檔案內容。

# memory.error.notFound
source: 메모리 파일 또는 저장소를 찾을 수 없습니다.
en: Memory file or repository not found.
ja: メモリファイルまたはリポジトリが見つかりません。
zh_hans: 未找到记忆文件或仓库。
zh_hant: 找不到記憶檔案或儲存庫。

# memory.error.rateLimited
source: GitHub 요청 제한을 초과했습니다. 잠시 후 다시 시도하세요.
en: GitHub rate limit exceeded. Try again later.
ja: GitHub のレート制限を超えました。後でお試しください。
zh_hans: 已超过 GitHub 速率限制。请稍后再试。
zh_hant: 已超過 GitHub 速率限制。請稍後再試。

# memory.error.unauthorized
source: GitHub 인증 실패. PAT를 확인하세요.
en: GitHub authentication failed. Check your PAT.
ja: GitHub 認証に失敗しました。PAT を確認してください。
zh_hans: GitHub 认证失败。请检查 PAT。
zh_hant: GitHub 驗證失敗。請檢查 PAT。

# memory.error.unsupportedEncoding
source: 파일이 너무 크거나 지원하지 않는 인코딩입니다. 데스크톱에서 편집하세요.
en: File too large or unsupported encoding. Edit on desktop.
ja: ファイルが大きすぎるか、サポートされないエンコーディングです。デスクトップで編集してください。
zh_hans: 文件过大或编码不支持。请在桌面上编辑。
zh_hant: 檔案過大或不支援的編碼。請於桌面編輯。

# memory.setupGitHub
source: GitHub 설정
en: Set up GitHub
ja: GitHub を設定
zh_hans: 设置 GitHub
zh_hant: 設定 GitHub

# memory.tab.global
source: 글로벌
en: Global
ja: グローバル
zh_hans: 全局
zh_hant: 全域

# memory.tab.local
source: 로컬
en: Local
ja: Local
zh_hans: Local
zh_hant: Local

# memory.title
source: 메모리
en: Memory
ja: メモリ
zh_hans: 记忆
zh_hant: 記憶

# modelPicker.effort.default
source: 기본값
en: Default
ja: デフォルト
zh_hans: 默认
zh_hant: 預設

# modelPicker.effort.footer
source: 강도가 높을수록 응답이 상세해지지만 비용도 증가합니다. 지원 모델에서만 적용됩니다.
en: Higher effort means more thorough responses at higher cost. Applies only to supported models.
ja: 強度が高いほど詳細な応答になりますが、コストも増加します。対応モデルにのみ適用されます。
zh_hans: 强度越高,回答越详尽,成本也越高。仅适用于支持的模型。
zh_hant: 強度越高,回答越詳盡,成本也越高。僅適用於支援的模型。

# modelPicker.effort.label
source: 응답 강도
en: Effort
ja: 応答強度
zh_hans: 应答强度
zh_hant: 應答強度

# modelPicker.title
source: 모델 선택
en: Select Model
ja: モデルを選択
zh_hans: 选择模型
zh_hant: 選擇模型

# onboarding.description
source: 메시지를 보내려면 본인의 API 키가 필요합니다. anthropic.com에서 발급받을 수 있습니다.
en: You need your own API key to send messages. Get one at anthropic.com.
ja: メッセージを送信するにはAPIキーが必要です。 anthropic.comで取得できます。
zh_hans: 发送消息需要您的 API 密钥。 请在 anthropic.com 获取。
zh_hant: 傳送訊息需要您的 API 密鑰。 請在 anthropic.com 取得。

# onboarding.save
source: 저장
en: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

# rate_limit.critical.a11y
source: %@ 한도 초과, 곧 재설정
en: %@ quota exhausted, resetting soon
ja: %@ の上限に達しました。まもなくリセットされます
zh_hans: %@ 配额已耗尽,即将重置
zh_hant: %@ 配額已耗盡,即將重置

# rate_limit.critical.format
source: %@ 한도 초과
en: %@ quota exhausted
ja: %@ の上限に達しました
zh_hans: %@ 配额已耗尽
zh_hant: %@ 配額已耗盡

# rate_limit.kind.input_tokens
source: 입력 토큰
en: Input tokens
ja: 入力トークン
zh_hans: 输入令牌
zh_hant: 輸入權杖

# rate_limit.kind.output_tokens
source: 출력 토큰
en: Output tokens
ja: 出力トークン
zh_hans: 输出令牌
zh_hant: 輸出權杖

# rate_limit.kind.requests
source: 요청
en: Requests
ja: リクエスト
zh_hans: 请求
zh_hant: 請求

# rate_limit.kind.tokens
source: 토큰
en: Tokens
ja: トークン
zh_hans: 令牌
zh_hant: 權杖

# rate_limit.warning.a11y
source: %@ %d%% 사용 중, 주의
en: %@ %d%% used, caution
ja: %@ %d%% 使用中、注意
zh_hans: %@ 已使用 %d%%,请注意
zh_hant: %@ 已使用 %d%%,請注意

# rate_limit.warning.format
source: %@ %d%% 사용 중
en: %@ %d%% used
ja: %@ %d%% 使用中
zh_hans: %@ 已使用 %d%%
zh_hant: %@ 已使用 %d%%

# settings.anthropicKey
source: Anthropic 키
en: Anthropic Key
ja: Anthropic Key
zh_hans: Anthropic Key
zh_hant: Anthropic Key

# settings.elevenLabsKey
source: ElevenLabs TTS 키
en: ElevenLabs TTS Credentials
ja: ElevenLabs TTS Credentials
zh_hans: ElevenLabs TTS Credentials
zh_hant: ElevenLabs TTS Credentials

# settings.groqKey
source: Groq API 키
en: Groq API Key
ja: Groq API Key
zh_hans: Groq API Key
zh_hant: Groq API Key

# settings.menu.title
source: 설정
en: Settings
ja: Settings
zh_hans: Settings
zh_hant: Settings

# settings.tts.autoSpeak
source: 자동 재생
en: Auto Play
ja: Auto Play
zh_hans: Auto Play
zh_hant: Auto Play

# settings.tts.detail
source: 상세 설정...
en: Advanced...
ja: Advanced...
zh_hans: Advanced...
zh_hant: Advanced...

# settings.tts.stability
source: 안정성
en: Stability
ja: 安定性
zh_hans: 稳定性
zh_hant: 穩定性

# settings.tts.stability.footer
source: 0=다양한 표현, 1=일관성. 기본 0.5.
en: 0=expressive variation, 1=consistent. Default 0.5.
ja: 0=表現豊か、1=一貫性。デフォルト 0.5。
zh_hans: 0=表达多样，1=一致性。默认 0.5。
zh_hant: 0=表達多樣，1=一致性。預設 0.5。

# settings.tts.similarity
source: 유사도
en: Similarity
ja: 類似度
zh_hans: 相似度
zh_hant: 相似度

# settings.tts.similarity.footer
source: 높을수록 원본 음성에 가까움. 기본 0.75.
en: Higher = closer to the original voice. Default 0.75.
ja: 高いほど元の音声に近い。デフォルト 0.75。
zh_hans: 越高越接近原始声音。默认 0.75。
zh_hant: 越高越接近原始聲音。預設 0.75。

# settings.tts.style
source: 스타일
en: Style
ja: スタイル
zh_hans: 风格
zh_hant: 風格

# settings.tts.style.footer
source: 높을수록 표현 강해지지만 느려짐. 기본 0.
en: Higher = more expressive but slower. Default 0.
ja: 高いほど表現豊かだが遅い。デフォルト 0。
zh_hans: 越高越有表现力但更慢。默认 0。
zh_hant: 越高越有表現力但更慢。預設 0。

# settings.tts.speakerBoost
source: 스피커 부스트
en: Speaker boost
ja: スピーカーブースト
zh_hans: 扬声器增强
zh_hant: 揚聲器增強

# settings.tts.speakerBoost.footer
source: 화자 음성 명료도를 향상시킴.
en: Improves clarity of the speaker's voice.
ja: 話者の声を明瞭にします。
zh_hans: 提升说话者声音的清晰度。
zh_hant: 提升說話者聲音的清晰度。

# settings.tts.title
source: 음성 설정
en: Voice Settings
ja: Voice Settings
zh_hans: Voice Settings
zh_hant: Voice Settings

# settings.tts.voice
source: 음성
en: Voice
ja: Voice
zh_hans: Voice
zh_hant: Voice

# settings.tts.voice.empty
source: 사용 가능한 음성이 없습니다.
en: No voices available.
ja: 利用できるボイスがありません。
zh_hans: 没有可用的语音。
zh_hant: 沒有可用的語音。

# settings.tts.voice.loading
source: 음성 목록 로드 중…
en: Loading voices…
ja: ボイスを読み込み中…
zh_hans: 正在加载语音…
zh_hant: 正在載入語音…

# settings.tts.voice.retry
source: 다시 시도
en: Retry
ja: 再試行
zh_hans: 重试
zh_hant: 重試

# speech.banner.title
source: 음성 재생 오류
en: Voice Playback Error
ja: Voice Playback Error
zh_hans: Voice Playback Error
zh_hant: Voice Playback Error

# speech.error.cancelled
source: 재생이 취소됐어.
en: Playback cancelled.
ja: Playback cancelled.
zh_hans: Playback cancelled.
zh_hant: Playback cancelled.

# speech.error.decoding
source: 오디오 응답을 해석하지 못했어.
en: Failed to decode audio response.
ja: Failed to decode audio response.
zh_hans: Failed to decode audio response.
zh_hant: Failed to decode audio response.

# speech.error.network
source: 네트워크 문제로 합성 실패.
en: Synthesis failed due to network error.
ja: Synthesis failed due to network error.
zh_hans: Synthesis failed due to network error.
zh_hant: Synthesis failed due to network error.

# speech.error.playback
source: 오디오 재생 실패.
en: Audio playback failed.
ja: Audio playback failed.
zh_hans: Audio playback failed.
zh_hant: Audio playback failed.

# speech.error.rate_limited
source: TTS 쿼터 초과. 잠시 후 다시 시도해줘.
en: TTS quota exceeded. Please try again later.
ja: TTS quota exceeded. Please try again later.
zh_hans: TTS quota exceeded. Please try again later.
zh_hant: TTS quota exceeded. Please try again later.

# speech.error.server
source: TTS 서버 오류.
en: TTS server error.
ja: TTS server error.
zh_hans: TTS server error.
zh_hant: TTS server error.

# speech.error.tooLong
source: 응답이 너무 길어 재생하지 않습니다.
en: Response too long to speak.
ja: 応答が長すぎて再生できません。
zh_hans: 回复过长，无法朗读。
zh_hant: 回覆過長，無法朗讀。

# speech.error.unauthorized
source: TTS 인증 실패. API 키를 확인해줘.
en: TTS authentication failed. Please check your API key.
ja: TTS authentication failed. Please check your API key.
zh_hans: TTS authentication failed. Please check your API key.
zh_hant: TTS authentication failed. Please check your API key.

# speech.error.voiceUnavailable
source: 이 음성은 현재 플랜에서 사용할 수 없습니다.
en: This voice isn't available on your current plan.
ja: このボイスは現在のプランで利用できません。
zh_hans: 当前套餐无法使用此语音。
zh_hant: 目前方案無法使用此語音。

# storage.error.body
source: 대화 저장소를 열 수 없습니다. 스토리지 손상, 마이그레이션 실패, 디스크 용량 부족 등이 원인일 수 있습니다.
en: We couldn't open your conversation store. This may be due to storage corruption, a failed migration, or insufficient disk space.
ja: 会話ストアを開けませんでした。ストレージの破損、マイグレーションの失敗、ディスク容量不足などが原因かもしれません。
zh_hans: 无法打开会话存储。可能是因为存储损坏、迁移失败或磁盘空间不足。
zh_hant: 無法開啟對話儲存。可能是儲存損毀、遷移失敗或磁碟空間不足所致。

# storage.error.resetButton
source: 스토리지 초기화
en: Reset storage
ja: ストレージをリセット
zh_hans: 重置存储
zh_hant: 重設儲存

# storage.error.resetConfirm
source: 초기화
en: Reset
ja: リセット
zh_hans: 重置
zh_hant: 重設

# storage.error.resetConfirmMessage
source: 저장된 모든 대화가 삭제됩니다. 되돌릴 수 없습니다.
en: All saved conversations will be deleted. This cannot be undone.
ja: 保存された会話がすべて削除されます。この操作は元に戻せません。
zh_hans: 所有已保存的对话将被删除。此操作无法撤消。
zh_hant: 所有已儲存的對話將被刪除。此操作無法復原。

# storage.error.resetConfirmTitle
source: 스토리지를 초기화하시겠습니까?
en: Reset storage?
ja: ストレージをリセットしますか?
zh_hans: 要重置存储吗?
zh_hant: 要重設儲存嗎?

# storage.error.resetDoneBody
source: 스토리지가 초기화되었습니다. 앱을 완전히 종료한 후 다시 실행해 주세요.
en: Storage reset. Please force-quit the app and reopen it to start fresh.
ja: ストレージをリセットしました。アプリを強制終了して再起動してください。
zh_hans: 存储已重置。请强制退出应用并重新打开。
zh_hant: 儲存已重設。請強制結束 App 並重新開啟。

# storage.error.resetFailedTitle
source: 초기화 실패
en: Reset failed
ja: リセットに失敗しました
zh_hans: 重置失败
zh_hant: 重設失敗

# storage.error.title
source: 스토리지를 사용할 수 없음
en: Storage unavailable
ja: ストレージを利用できません
zh_hans: 存储不可用
zh_hant: 儲存空間無法使用

# stt.banner.title
source: 음성 입력 오류
en: Voice Input Error
ja: Voice Input Error
zh_hans: Voice Input Error
zh_hant: Voice Input Error

# stt.error.audio_too_long
source: 녹음이 60초를 넘었어. 짧게 나눠서 말해줘.
en: Recording exceeded 60 seconds. Please speak in shorter clips.
ja: Recording exceeded 60 seconds. Please speak in shorter clips.
zh_hans: Recording exceeded 60 seconds. Please speak in shorter clips.
zh_hant: Recording exceeded 60 seconds. Please speak in shorter clips.

# stt.error.cancelled
source: 녹음이 취소됐어.
en: Recording cancelled.
ja: Recording cancelled.
zh_hans: Recording cancelled.
zh_hant: Recording cancelled.

# stt.error.decoding
source: Groq 응답을 해석하지 못했어.
en: Failed to decode Groq response.
ja: Failed to decode Groq response.
zh_hans: Failed to decode Groq response.
zh_hant: Failed to decode Groq response.

# stt.error.mic_permission
source: 마이크 권한이 거부됐어. 설정에서 권한을 켜줘.
en: Microphone permission denied. Enable it in Settings.
ja: Microphone permission denied. Enable it in Settings.
zh_hans: Microphone permission denied. Enable it in Settings.
zh_hant: Microphone permission denied. Enable it in Settings.

# stt.error.network
source: 네트워크 문제로 전사 실패했어.
en: Transcription failed due to network error.
ja: Transcription failed due to network error.
zh_hans: Transcription failed due to network error.
zh_hant: Transcription failed due to network error.

# stt.error.rate_limited
source: Groq 쿼터 초과. 잠시 후 다시 시도해줘.
en: Groq quota exceeded. Please try again later.
ja: Groq quota exceeded. Please try again later.
zh_hans: Groq quota exceeded. Please try again later.
zh_hant: Groq quota exceeded. Please try again later.

# stt.error.recording
source: 녹음 중 문제가 생겼어. 다시 시도해줘.
en: Recording failed. Please try again.
ja: Recording failed. Please try again.
zh_hans: Recording failed. Please try again.
zh_hant: Recording failed. Please try again.

# stt.error.server
source: Groq 서버 오류.
en: Groq server error.
ja: Groq server error.
zh_hans: Groq server error.
zh_hant: Groq server error.

# stt.error.unauthorized
source: Groq 인증 실패. API 키를 확인해줘.
en: Groq authentication failed. Please check your API key.
ja: Groq authentication failed. Please check your API key.
zh_hans: Groq authentication failed. Please check your API key.
zh_hant: Groq authentication failed. Please check your API key.

# stt.settings
source: 설정 열기
en: Open Settings
ja: Open Settings
zh_hans: Open Settings
zh_hant: Open Settings

# writeApproval.after
source: 새 내용
en: After
ja: After
zh_hans: After
zh_hant: After

# writeApproval.before
source: 기존
en: Before
ja: Before
zh_hans: Before
zh_hant: Before

# writeApproval.cancel
source: 취소
en: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# writeApproval.commitMessage
source: 커밋
en: Commit
ja: コミット
zh_hans: 提交
zh_hant: 提交

# writeApproval.diff
source: 변경 내용
en: Diff
ja: 差分
zh_hans: 差异
zh_hant: 差異

# writeApproval.new
source: 신규 파일
en: New file
ja: New file
zh_hans: New file
zh_hant: New file

# writeApproval.noChange
source: 변경 없음
en: No change
ja: No change
zh_hans: No change
zh_hant: No change

# writeApproval.path
source: 경로
en: Path
ja: パス
zh_hans: 路径
zh_hant: 路徑

# writeApproval.role
source: 역할
en: Role
ja: ロール
zh_hans: 角色
zh_hant: 角色

# writeApproval.save
source: 저장
en: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

# writeApproval.title
source: 메모리에 쓰시겠어요?
en: Write memory?
ja: メモリを書き込みますか?
zh_hans: 写入记忆吗?
zh_hant: 要寫入記憶嗎?
